       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVEPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR-A PIC X(10) VALUE "ABC".
       01 WS-STR-B PIC X(5).
       01 WS-NUM-A PIC 9(4) VALUE 123.
       01 WS-NUM-B PIC 9(6).
       PROCEDURE DIVISION.
           MOVE WS-STR-A TO WS-STR-B
           MOVE WS-NUM-A TO WS-NUM-B
           DISPLAY WS-STR-B
           DISPLAY WS-NUM-B
           GOBACK.
