//BANKCORE JOB (ACCT),'BANKCORE EOD',CLASS=A,MSGCLASS=X
//* ---------------------------------------------------------------
//* BANKCORE ENTERPRISE NIGHTLY BATCH
//* ---------------------------------------------------------------
//LOAD     EXEC PGM=BCLOAD01
//STEPLIB  DD DSN=BANKCORE.LOADLIB,DISP=SHR
//OUT1     DD DSN=BANKCORE.CUSTOMER.MASTER,DISP=OLD
//OUT2     DD DSN=BANKCORE.ACCOUNT.MASTER,DISP=OLD
//* ---------------------------------------------------------------
//PROCESS  EXEC PGM=BCPROC01
//STEPLIB  DD DSN=BANKCORE.LOADLIB,DISP=SHR
//TXNIN    DD DSN=BANKCORE.DAILY.TRANSACTIONS,DISP=SHR
//AUDIT    DD DSN=BANKCORE.TRANSACTION.AUDIT,DISP=MOD
//EXCEPT   DD DSN=BANKCORE.TRANSACTION.EXCEPT,DISP=MOD
//* ---------------------------------------------------------------
//REPORT   EXEC PGM=BCREPT01
//STEPLIB  DD DSN=BANKCORE.LOADLIB,DISP=SHR
//AUDITIN  DD DSN=BANKCORE.TRANSACTION.AUDIT,DISP=SHR
//EXCIN    DD DSN=BANKCORE.TRANSACTION.EXCEPT,DISP=SHR
//REPORT   DD DSN=BANKCORE.EOD.REPORT,DISP=MOD
//* ---------------------------------------------------------------
// IF LOAD.RC > 0 THEN
//   SET ABEND=TRUE
// ENDIF
