       IDENTIFICATION DIVISION.
       PROGRAM-ID. BINIO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BIN-FILE ASSIGN TO "BINFILE.DAT"
           ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD BIN-FILE.
       01 BIN-REC.
          05 FIELD-COMP3 PIC S9(4)V99 COMP-3.
          05 FIELD-ZONED PIC S9(4) SIGN IS TRAILING SEPARATE CHARACTER.
       WORKING-STORAGE SECTION.
       01 WS-VAR.
          05 WS-COMP3 PIC S9(4)V99 COMP-3.
          05 WS-ZONED PIC S9(4) SIGN IS TRAILING SEPARATE CHARACTER.
       PROCEDURE DIVISION.
           OPEN OUTPUT BIN-FILE.
           MOVE -12.34 TO WS-COMP3.
           MOVE -5678 TO WS-ZONED.
           MOVE WS-COMP3 TO FIELD-COMP3.
           MOVE WS-ZONED TO FIELD-ZONED.
           WRITE BIN-REC.
           CLOSE BIN-FILE.
           
           INITIALIZE BIN-REC.
           OPEN INPUT BIN-FILE.
           READ BIN-FILE.
           CLOSE BIN-FILE.
           DISPLAY FIELD-COMP3.
           DISPLAY FIELD-ZONED.
           GOBACK.
