IDENTIFICATION DIVISION.
PROGRAM-ID. CLMTRANS.
PROCEDURE DIVISION.
    EXEC CICS RECEIVE MAP('CLAIMMP') END-EXEC
    EXEC CICS LINK PROGRAM('CLAIM01') END-EXEC
    EXEC CICS SEND MAP('CLAIMMP') END-EXEC
    EXEC CICS RETURN END-EXEC
    GOBACK.
