IDENTIFICATION DIVISION.
PROGRAM-ID. POLTRANS.
PROCEDURE DIVISION.
    EXEC CICS RECEIVE MAP('POLICYMP') END-EXEC
    EXEC CICS XCTL PROGRAM('POLICY01') END-EXEC
    EXEC CICS RETURN END-EXEC
    GOBACK.
