       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGOVER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GROUP.
          05 A PIC S9(2) SIGN IS TRAILING .
          05 FILLER PIC X VALUE '|'.
          05 B PIC S9(2) SIGN IS TRAILING .
       PROCEDURE DIVISION.
           INITIALIZE A B.
           MOVE -99 TO A.
           MOVE -10 TO B.
           SUBTRACT 5 FROM A GIVING B ON SIZE ERROR DISPLAY 'UNDERFLOW'.
           DISPLAY WS-GROUP.
           GOBACK.