01 CUSTOMER-REC.
   05 CUSTOMER-ID       PIC X(20).
   05 CUSTOMER-NAME     PIC X(100).
   05 CUSTOMER-STATUS   PIC X(12).
   05 CUSTOMER-DATE     PIC 9(8).
