01 PAYMENT-REC.
   05 PAYMENT-ID        PIC X(20).
   05 PAYMENT-CLAIM     PIC X(20).
   05 PAYMENT-NET       PIC 9(13)V99.
   05 PAYMENT-STATUS    PIC X(20).
