       01  ACCOUNT-RECORD.
           05  ACCT-ID             PIC X(10).
           05  ACCT-CUST-ID        PIC X(06).
           05  ACCT-TYPE           PIC X(02).
           05  ACCT-STATUS         PIC X(01).
           05  ACCT-CURRENCY       PIC X(03).
           05  ACCT-BALANCE        PIC S9(11)V99 COMP-3.
           05  ACCT-OD-LIMIT       PIC S9(9)V99 COMP-3.
           05  ACCT-OPEN-DATE      PIC 9(8).
           05  ACCT-RESERVED       PIC X(10).
