       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLCONTB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ORIGINAL PIC S9(5)V99 VALUE 123.45.
       PROCEDURE DIVISION.
           CALL "MUTATORB" USING BY CONTENT WS-ORIGINAL.
           DISPLAY WS-ORIGINAL.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MUTATORB.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-PARAM PIC S9(5)V99.
       PROCEDURE DIVISION USING LS-PARAM.
           ADD 1.00 TO LS-PARAM.
           GOBACK.
       END PROGRAM MUTATORB.
       END PROGRAM CALLCONTB.
