IDENTIFICATION DIVISION.
PROGRAM-ID. AUDIT01.
DATA DIVISION.
WORKING-STORAGE SECTION.
PROCEDURE DIVISION.
    DISPLAY "AUDIT EVENT".
    EXEC SQL
        INSERT INTO AUDIT_LOG
        (AUDIT_ID, ENTITY_ID, EVENT_TYPE, EVENT_MESSAGE, EVENT_DATE)
        VALUES (:AUDIT-ID, :ENTITY-ID, :EVENT-TYPE, :EVENT-MESSAGE, CURRENT DATE)
    END-EXEC.
    GOBACK.
