IDENTIFICATION DIVISION.
PROGRAM-ID. CLAIM01.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY CLAIM.
COPY POLICY.
PROCEDURE DIVISION.
    DISPLAY "CLAIM SUBMISSION".
    EXEC CICS RECEIVE MAP('CLAIMMP') END-EXEC.
    CALL 'CLAIM02' USING CLAIM-REC POLICY-REC.
    EXEC CICS SYNCPOINT END-EXEC.
    EXEC CICS RETURN END-EXEC.
    GOBACK.
