IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER01.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY CUSTOMER.
PROCEDURE DIVISION.
    DISPLAY "CUSTOMER INQUIRY".
    EXEC SQL
        SELECT CUSTOMER_NAME, STATUS
          INTO :CUSTOMER-NAME, :CUSTOMER-STATUS
          FROM CUSTOMER
         WHERE CUSTOMER_ID = :CUSTOMER-ID
    END-EXEC.
    GOBACK.
