IDENTIFICATION DIVISION.
PROGRAM-ID. PAYMENT01.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY CLAIM.
COPY PAYMENT.
PROCEDURE DIVISION.
    COMPUTE PAYMENT-NET = CLAIM-APPROVED - 5000.
    IF PAYMENT-NET < 0 MOVE 0 TO PAYMENT-NET END-IF.
    EXEC SQL
        INSERT INTO PAYMENT
        (PAYMENT_ID, CLAIM_ID, NET_AMOUNT, PAYMENT_STATUS)
        VALUES (:PAYMENT-ID, :CLAIM-ID, :PAYMENT-NET, 'READY')
    END-EXEC.
    EXEC SQL COMMIT END-EXEC.
    GOBACK.
