       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEQFILEPROG.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-FILE ASSIGN TO "OUTFILE.TXT"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD OUT-FILE.
       01 OUT-REC PIC X(20).
       PROCEDURE DIVISION.
           OPEN OUTPUT OUT-FILE
           MOVE "HELLO WORLD 1" TO OUT-REC
           WRITE OUT-REC
           MOVE "HELLO WORLD 2" TO OUT-REC
           WRITE OUT-REC
           CLOSE OUT-FILE
           DISPLAY "FILE WRITTEN"
           GOBACK.
