       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLCONT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ORIGINAL PIC 9(6) VALUE 999.
       PROCEDURE DIVISION.
           CALL "MUTATOR" USING BY CONTENT WS-ORIGINAL.
           DISPLAY WS-ORIGINAL.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MUTATOR.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-PARAM PIC 9(6).
       PROCEDURE DIVISION USING LS-PARAM.
           ADD 1 TO LS-PARAM.
           GOBACK.
       END PROGRAM MUTATOR.
       END PROGRAM CALLCONT.
