IDENTIFICATION DIVISION.
PROGRAM-ID. COMMONCALL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TARGET-PROGRAM PIC X(8) VALUE 'AUDIT01'.
PROCEDURE DIVISION.
    CALL TARGET-PROGRAM.
    GOBACK.
