       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLAIM03.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CLAIM.
       PROCEDURE DIVISION.
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS LINK PROGRAM('CLAIM02') END-EXEC.
           CONTINUE.
           GOBACK.
