       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLMTRANS.
       PROCEDURE DIVISION.
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS RECEIVE MAP('CLAIMMP') END-EXEC
           CONTINUE
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS LINK PROGRAM('CLAIM01') END-EXEC
           CONTINUE
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS SEND MAP('CLAIMMP') END-EXEC
           CONTINUE
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS RETURN END-EXEC
           CONTINUE
           GOBACK.
