       IDENTIFICATION DIVISION.
       PROGRAM-ID. POLTRANS.
       PROCEDURE DIVISION.
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS RECEIVE MAP('POLICYMP') END-EXEC
           CONTINUE
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS XCTL PROGRAM('POLICY01') END-EXEC
           CONTINUE
      *> [PREPROCESSED: CICS stub]
      *> EXEC CICS RETURN END-EXEC
           CONTINUE
           GOBACK.
