       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM-A PIC 9(4) VALUE 10.
       01 WS-NUM-B PIC 9(4) VALUE 20.
       01 WS-NUM-C PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
           ADD WS-NUM-A TO WS-NUM-B GIVING WS-NUM-C
           DISPLAY WS-NUM-C
           COMPUTE WS-NUM-C = WS-NUM-A * 5 + WS-NUM-B
           DISPLAY WS-NUM-C
           GOBACK.
