POLICYMP DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,STORAGE=AUTO
POLICYM DFHMDI SIZE=(24,80)
         DFHMDF POS=(3,10),LENGTH=20,ATTRB=(UNPROT,IC)
         DFHMDF POS=(5,10),LENGTH=12,ATTRB=PROT
         DFHMDF POS=(7,10),LENGTH=15,ATTRB=PROT
         DFHMSD TYPE=FINAL
